{
  "title": "Why are people ditching traditional money transfer channels for crypto remittance?",
  "content": "Cross-border money transfer is a hot topic when it comes to cryptocurrency use cases. Discussions often revolve around how crypto is revolutionizing remittances globally.\n\nAccelerated by the COVID-19 pandemic, the remittance industry has evolved from transfers via physical remittance stores to online transfers. In 2020, World Bank data recorded that global remittances to low- and middle-income countries reached US$540 billion. And in the future, crypto is expected to account for a larger share in global annual remittances.\n\nThe top five remittance recipient countries in 2020 were India (US$83.1 billion), China (US$59.5 billion), Mexico (US$42.9 billion), the Philippines (US34.9 billion), and Egypt (US$29.6 billion). India has been the largest recipient of remittances since 2018. The main driver of remittance flow was migrants’ desire to help their families during this uncertain time.  \n\nCountries Leveraging Crypto Remittance\nEl Salvador is one country that relies heavily on remittances, which make up 20% of its GDP. In 2020, 70% of the Salvadorean population received remittance payments, amounting to US$6 billion. The move making Bitcoin legal tender in September could potentially cost remittance companies US$400 million a year, estimated by Nayib Bukele, president of El Salvador. \n\n“Everyone is watching if it goes well for El Salvador and if, for example, the cost of remittances drops substantially… other countries will probably seek that advantage and adopt it,” Dante Mossi, the executive president of the Central American Bank for Economic Integration (CABEI), told Reuters.\n\nIn Africa, South Africa is the largest remittance sending market, mainly to SADC countries. Remittances from South Africa have been extremely expensive historically, which averaged 14.4% in Q4 of 2020. In 2019, up to 69% of South African adults had a formal account, including mobile money (RemitScope, 2021). The use of cryptocurrency in Africa is rising as it offers a swift and convenient channel for remittance payments.\n\nHow Crypto Remittance Made a Difference\nCryptocurrency offers a quick and easy way for remitters to send money across borders at a lower fee. Traditional remittance companies typically take around three days. With crypto, remitters can drastically reduce the duration to one business day. Cost-wise, the remittance fee for traditional remittances averaged 6.5% in the fourth quarter of 2020, whereas crypto transfer fee can be lesser than 1%. \n\n“Our crypto remittance service is here to enhance traditional money transfers, for remittance companies to offer an alternative to their customers to send money using crypto. The aim is to bridge the world of crypto with people’s daily living, ensuring their money is sent to their loved ones quickly, safely, and cost-effectively,” said Eric Barbier, CEO of Triple-A. \n\nSome may have underlined their concerns on Anti-Money Laundering (AML) and Combating the Financing of Terrorism (CFT) regarding crypto remittances. However, crypto companies, including ourselves, have boosted compliance steps by requesting remitters’ identification documents to ensure their crypto came from legal sources.\n\nThe decentralized nature of crypto has enabled individuals to take control of their money. It’s therefore not surprising that people are ditching traditional money transfer channels for crypto remittance.\n\n",
  "imageUrl": "https://triple-a.io/wp-content/uploads/2021/11/Frame-5-min.png",
  "description": "Crypto Insights"
}